import json

def to_json(dictionary, filename):
    with open(filename,'w') as fp:
        json.dump(dictionary, fp,sort_keys=True, indent=4,ensure_ascii=False)


myung = {
    '사랑방': {
        '메뉴': { '아메리카노':1800',
                 '에스프레소':1800
                },
        '위치': '경영관B',
        '전화번호': '02-740-1916',
        '영업시간': [],
        '영업상태': True
    },
    'ttt': {
        '메뉴': {},
        '위치': '경영관B',
        '전화번호': '02-740-1916',
        '영업시간': [],
        '영업상태': True
    },
    '팬도로시': {
        '메뉴': {},
        '위치': '경영관B',
        '전화번호': '02-740-1916',
        '영업시간': [],
        '영업상태': True
    },
    'TakeOut커피점': {
        '메뉴': {},
        '위치': '경영관B',
        '전화번호': '02-740-1916',
        '영업시간': [],
        '영업상태': True
    },
    '레브': {
        '메뉴': {},
        '위치': '경영관B',
        '전화번호': '02-740-1916',
        '영업시간': [],
        '영업상태': True
    },
    '로봇커피': {
        '메뉴': {},
        '위치': '경영관B',
        '전화번호': '02-740-1916',
        '영업시간': [],
        '영업상태': True
    }
}

yul = {
    '커피빈',
    '카페나무',
    '팬도로시',
    '카페NU',
    '로봇커피'
}